cf_billing/InformationRegisters/энргУстановленныеПараметрыРасчетаНорматива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУстановленныеПараметрыРасчетаНорматива</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыНачислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разрез</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргКлючевыеПараметрыНорматива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СоциальныйНорматив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргКлючевыеПараметрыНорматива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргКлючевыеПараметрыНорматива</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВидБлагоустройства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГодПостройки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоКомнат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЧеловек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоЭтажей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмерительНаправленияИспользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипМестности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипПлиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщаяПлощадьМОПНаЧеловека</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоСобственников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПрописанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоПроживающих</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/InformationRegisters/энргУстановленныеПараметрыРасчетаНорматива/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргУстановленныеПараметрыРасчетаНорматива(ЭтотОбъект);
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.НашаОрганизация;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазрезНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.ВидБлагоустройства"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоКомнат"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоЧеловек"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.ИзмерительНаправленияИспользования"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоСобственников"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПрописанных"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.энргКлючевыеПараметрыНорматива.КоличествоПроживающих"));
	
КонецПроцедуры

#КонецОбласти
